#Открываю файл
with open("27-B.txt", "r") as a:
    b = a.readlines()
    n = int(b[0])
    b = list(map(int, b[1:]))

#Создаю отсортированные массивы по возрастанию (критерии - остаток от деления на 3)
n0 = sorted(filter(lambda x: x % 3 == 0, b))
n1 = sorted(filter(lambda x: x % 3 == 1, b))
n2 = sorted(filter(lambda x: x % 3 == 2, b))

#Нам подходят 4 случая:
#1. Все кратны 3 (0 + 0 + 0)
#2. Все с остатком от деления = 1 (1 + 1 + 1 = 3)
#3. Все с остатком от деления = 2 (2 + 2 + 2 = 6)
#4. У первого остаток 0, у второго 1, у третьего 2 (0 + 1 + 2 = 3)
print(min(n0[0] + n0[1] + n0[2], n1[0] + n1[1] + n1[2], n2[0] + n2[1] + n2[2], n0[0] + n1[0] + n2[0]))